app/controllers/add_controller.rb

INSERT INTO "cars" ("brand", "model", "modification", "year", "price", "run", "brown", "engine_capaciti", "occasion", "state", "color", "region", "city", "description", "vin_code", "accident", "tel", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        @car = Car.new car_params
        if @car.save