app/controllers/recent_controller.rb

    def index
      @cars = Car.all.order("created_at DESC")
---
SELECT "cars".* FROM "cars" ORDER BY created_at DESC