app/controllers/recommendation_controller.rb

  def index
    @cars = Car.all.order("created_at DESC")
---
SELECT "cars".* FROM "cars" ORDER BY created_at DESC

  def show
    @car = Car.find_by id: params[:id]
---
SELECT "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]